package com.example.telegramanimalshelterholiday.constants;

public class InfoConstantsShelters {

    //расписание работы приюта
    public static final String GREETING_CAT_SHELTER = "Добро пожаловать в приют кошек!";

    public static final String ABOUT_CAT_SHELTER = "Мы - приют животных из Астаны, который хочет помочь людям, которые задумываются о том, чтобы забрать кошку домой.";
    public static final String WORK_HOURS_CAT_SHELTER = "Наш приют рад встрече с Вами ежедневно с 09.00 до 19.00";

    // контактные данные охраны для оформления пропуска на машину
    public static final String CAR_PASS_INFO_CAT = "Заезд для автомобилистов со стороны проезда Котейкина до шлагбаума.\n" +
            "(адрес для навигатора: Котейкин проезд). " +
            "На территории имеется парковка.\n Для оформления пропуска просим связаться с охраной по телефону 678-95-14.\n";

    // общие рекомендации по технике безопасности на территории приютов
    public static final String SECURITY_MEASURES_SHELTERS = "Все посетители приюта обязаны соблюдать правила безопасного поведения.\n"
            + "Запрещается носить в карманах одежды колющие, режущие и стеклянные предметы.\n" +
            "Посетители должны вести себя спокойно и тихо, поскольку животные не любят шума и суеты.\n Бегать и кричать категорически запрещается.\n" +
            "При входе в какое-либо помещение или вольер или выходе из него необходимо обязательно закрыть дверь.\n" +
            "Посетители приюта обязаны всегда строго и незамедлительно следовать указаниям работников приюта.";


    //расписание работы приюта для собак
    public static final String GREETING_DOG_SHELTER = "Добро пожаловать в приют собак!";

    public static final String ABOUT_DOG_SHELTER = "Мы - приют животных из Астаны, который хочет помочь людям, которые задумываются о том, чтобы забрать собаку домой.";

    public static final String WORK_HOURS_DOG_SHELTER = "Наш приют рад встрече с Вами ежедневно с 10.00 до 19.00";

    // контактные данные охраны для оформления пропуска на машину
    public static final String CAR_PASS_INFO_DOG = "Заезд для автомобилистов со стороны проезда Собакевича до шлагбаума.\n" +
            "(адрес для навигатора: Собакевича проезд). " +
            "На территории имеется парковка.\n Для оформления пропуска просим связаться с охраной по телефону 871-52-40.\n";


}
