package com.example.telegramanimalshelterholiday.constants;
import lombok.Data;

@Data
public class Recommendation {

    public final static String INFO_ABOUT_ADOPTION = "Усыновление животного это ответственный шаг. Прежде чем решиться на него необходимо " +
            " объективно оценить свои возможности, отдавая себе отчет в том, что это не только большая радость, но и большая ответственность. " +
            "Наши рекомендации помогут вам в этом, а если этого будет недостаточно, то вы всегда можете обратиться к нашим специалистам, " +
            "они с радостью ответят на интересующие вас вопросы.";

    public final static String RULES_HOW_TO_MEET_CAT = "Знакомство с кошкой происходит не за несколько минут и даже не за несколько часов. " +
            "К этому вопросу нужно подходить со всей серьезностью и ответственностью. Ведь первые два-три дня — это время, когда кошка учится вам доверять." +
            "Не забывайте, что кошки — не собаки. Они также любят людей, но их границы шире, чем у собак, поэтому важно, чтобы кошка проявила " +
            "к вам интерес сама — это наиболее экологичный способ начать общение." +
            "Все ваши действия должны быть позитивными: никаких громких звуков, резких движений. " +
            "Избегайте всего, что может хоть немного напугать кошку, это поможет закрепить в ее глазах приятные ассоциации с вами и начать вам доверять.";

    public final static String RULES_HOW_TO_MEET_DOG = "Если вы хотите с ней познакомиться, присядьте на ее уровень и спокойно попросите ее подойти, " +
            "произнеся кличку. Если собака насторожилась или боится, не настаивайте на контакте, дождитесь, пока она сама захочет к вам подойти. " +
            "Дайте собаке возможность вас обнюхать, не смотрите ей прямо в глаза.";

    public final static String DOCUMENTS_NEEDED_TO_ADOPT_ANIMAL = "1. Паспорт " +
            "2. Договор с приютом \n";

    public final static String RECOMMENDATIONS_FOR_DOG_TRANSPORTATION = " В наземном городском транспорте общего пользования, а именно в трамваях, троллейбусах и автобусах, " +
            "крупных собак можно провозить на задней площадке, но они обязательно должны быть в наморднике и на коротком поводке. " +
            "Маленьких животных провозят в специальных контейнерах." +
            "Что касается перевозки питомца в личном автомобиле, согласно Правилам дорожного движения " +
            "транспортировка животных приравнивается к перевозке грузов.  " +
            "В п. 23.3 ПДД говорится, что груз не должен ограничивать обзор водителя или как-то иначе мешать управлению.";

    public final static String RECOMMENDATIONS_FOR_CAT_TRANSPORTATION = "Корзина для кошки должна быть цельная, с водонепроницаемым дном, определенных размеров, " +
            "не превышающих установленные нормы (не более 120 см, если суммировать глубину, ширину и длину). Если переноска превышает разрешенные габариты, " +
            "необходимо произвести доплату за провоз ручной клади. Чтобы ваш питомец привык к переноске, оставьте ее доступной для кошки, " +
            "чтобы она смогла привыкнуть к ней и воспринимать как часть интерьера." +
            "Когда наступит момент воспользоваться переноской, положите в нее подстилку и что-то из одежды с вашим запахом и запахом кошки, " +
            "чтобы ваш питомец чувствовал себя максимально комфортно и безопасно.";

    public final static String RECOMMENDATIONS_FOR_HOME_ADJUSTMENT_FOR_KITTY = "В доме должно быть: 1. Качественный корм для котят, подходящий по возрасту\n" +
            "2. Миски для корма и воды\n" +
            "3. Всё для туалета: лоток, наполнитель, решетчатый совочек\n" +
            "4. Лежанка\n" +
            "5. Когтеточка\n" +
            "6. Контейнер-«переноска»\n" +
            "7. Безопасные игрушки\n" +
            "8. Впитывающие пеленки на первое время и для поездок";

    public final static String RECOMMENDATIONS_FOR_HOME_ADJUSTMENT_FOR_PUPPY = "В доме должно быть: 1. Место для сна Выберите место, где будет легко поддерживать чистоту и где щенку будет просторно даже в более зрелом возрасте.\n" +
            "2. Пеленки для щенков \n" +
            "3. Переноска \n" +
            "4. Миски для воды и корма \n" +
            "5. Корм для щенков в период роста \n" +
            "6. Игрушки \n" +
            "7. Ошейник и поводок \n" +
            "8. Моющие средства";

    public final static String RECOMMENDATIONS_FOR_HOME_ADJUSTMENT_FOR_CAT = "В доме должно быть: 1. Качественный, подходящий по возрасту\n" +
            "2. Миски для корма и воды\n" +
            "3. Всё для туалета: лоток, наполнитель, решетчатый совочек\n" +
            "4. Лежанка\n" +
            "5. Когтеточка\n" +
            "6. Контейнер-«переноска»\n" +
            "7. Безопасные игрушки";

    public final static String RECOMMENDATIONS_FOR_HOME_ADJUSTMENT_FOR_DOG = "В доме должно быть: 1. Место для сна, лежанка.\n" +
            "2. Миски для воды и корма \n" +
            "3. Корм \n" +
            "4. Игрушки \n" +
            "5. Ошейник и поводок \n" +
            "6. Моющие средства";
    ;

    public final static String RECOMMENDATIONS_FOR_HOME_ADJUSTMENT_FOR_ANIMAL_WITH_SIGHTPROBLEMS = "Орагнизуйте максимально просторное пространство, чтобы избежать" +
            "столкновений питомца с различными предметами. Для обозначения места для сна или туалета используйте вещи с запахом самого животного или " +
            "специальные средства.";
    public final static String RECOMMENDATIONS_FOR_HOME_ADJUSTMENT_FOR_ANIMAL_WITH_MOBILITYPROBLEMS = "Если питомцу тяжело передвигаться, то организуйте пространство" +
            " так, чтобы ему не приходилось преодолевать большое расстояние. " +
            "В особо тяжелых случаях вы можете использовать специальные инвалидные коляски для животных (нативная реклама)";

    public final static String RECOMMENDATIONS_FOR_THE_FIRST_MEETING_WITH_DOGHANDLER = "1. Обеспечьте своей собаке достаточную физическую активность. Регулярные прогулки, игры и тренировки помогут поддерживать ее физическую форму и здоровье.\n" +
            "2. Познакомьтесь с основами положительного обучения. Используйте поощрения и похвалу, чтобы стимулировать желаемое поведение у собаки.\n" +
            "3. Уделите время социализации своей собаки. Познакомьте ее с разными людьми, другими собаками и различными ситуациями, чтобы она чувствовала себя комфортно в разных обстановках.\n" +
            "4. Позаботьтесь о правильном питании своей собаки. Выберите качественные сухие или натуральные корма, соответствующие ее возрасту, размеру и потребностям.\n" +
            "5. Уделите внимание уходу за шерстью и кожей собаки. Регулярно расчесывайте ее шерсть, проверяйте наличие паразитов и используйте специальные средства для ухода.\n" +
            "6. Обеспечьте своей собаке безопасное и комфортное место для отдыха и сна. Установите ей свою специальную кошку или место, где она будет чувствовать себя защищенной.\n" +
            "7. Не забывайте о регулярных посещениях ветеринара. Вакцинация, обработка от паразитов и осмотр помогут поддерживать здоровье вашей собаки.\n" +
            "8. Не используйте физическое насилие или жестокие методы в обучении собаки. Используйте только положительные методы обучения и поведения.\n" +
            "9. Внимательно следите за поведением своей собаки и реагируйте на любые изменения. Если у вас возникнут вопросы или проблемы, обратитесь за помощью к профессиональному кинологу.\n" +
            "10. Не забывайте о любви и заботе. Собаки нуждаются в вашей привязанности и внимании, поэтому проводите время с ними, играйте, ласкайте и показывайте им свою любовь.";

    public final static String RECOMMENDATIONS_OF_DOGSHANDLERS = "Список проверенных кинологов: \n" +
            "Грызлов Павел Петрович тел. 0000000 \n" +
            "Дружков Константин Иванович тел. 000000 \n" +
            "Щенкова Оксана Анатольевна тел. 00000 \n" +
            "Сычев Роман Андреевич тел. 00000";

    public final static String REASONS_OF_REJECTION_TO_ADOPT = "«Мы можем назвать только три причины, по которым приют может не отдать человеку животное: " +
            "человек состоит на учёте в психдиспансере, у человека есть судимость, человек замечен в жестоком обращении с животными";

    /*public final static String REASONS_OF_REJECTION_TO_ADOPT_DOG = "«Мы можем назвать только три причины, по которым приют может не отдать человеку животное:" +
            " человек состоит на учёте в психдиспансере, у человека есть судимость, человек замечен в жестоком обращении с животными";*/


}
